In [83]:
import numpy as np
import pandas as pd

# Carregar Dados

## Dados Rankings

Será comparado o desempenho das universidades nos três rankings universitário mais antigos e influentes, são eles:

- World University Rankings publicado pela Times Higher Education (THE);
- QS World University Rankings publicado pela Quacquarelli Symonds (QS);
- Academic Ranking of World Universities publicado pela Shanghai Ranking Consultancy.

In [84]:
#Caminho onde estão as pastas com os dados
path='/home/rodolfo/Insync/rodolfopcruz2@gmail.com/Google Drive/Estudo/Python_Projects/education_data/dados/Comparativo/'

ranking_the         =pd.read_csv(path+'Rankings/times_higher_education_rankings.csv')
ranking_qs_2017_2022=pd.read_csv(path+'Rankings/qs_ranking_2017_2022.csv')
ranking_qs_2023_2025=pd.read_csv(path+'Rankings/qs_ranking_2023_2025.csv')
ranking_shanghai     =pd.read_csv(path+'Rankings/ranking_Shanghai.csv')

## Dados Educacionais

Serão analisados dados educacionais dos países buscando entender o desempenho de suas universidades nos rankings globais.

Os dados incluem:

- Investimentos dos países em cada nível educacional (em milhoões de dólares e em porcentagem do PIB);
- Escolaridade média da população;
- Número de alunos estrangeiros;
- Proporção do total de indivíduos em idade escolar matriculados em instituições de ensino.

- Fonte dos dados:

    - investimentos_publicos_privados : https://nces.ed.gov/programs/digest/d14/tables/dt14_605.20.asp
    - restante: http://data.uis.unesco.org/

In [85]:
#Caminho onde estão as pastas com os dados
path='/home/rodolfo/Insync/rodolfopcruz2@gmail.com/Google Drive/Estudo/Python_Projects/education_data/dados/Comparativo/'

In [86]:
#mean_year_schooling é a escolaridade média da população acima de 25 anos
#investimentos_publicos_privados contem o valor direto investido em educação pelos setores públicos e privados (em proporção do PIB)
#investimento_em_milhoes é o tatal investido (em milhões de dólares) em educação pelos setores públicos dos países


mean_year_schooling=pd.read_excel(path+'Mean_Years_Of_Schooling/mean_years.xlsx') 
investimentos_publicos_privados=pd.read_excel(path+'Public and private direct expenditures on education/public_private_expenditure.xlsx')
investimento_em_milhoes=pd.read_excel(path+'Government expenditure on education in constant US$/gasto_educacao_ajustado_inflacao.xlsx')

In [87]:
#Número total de alunos matriculados em cada nível educacional

matriculas_primario=pd.read_excel(path+'Enrollment-Number/enrollment-primary-education-number.xlsx') #total de alunos matriculados no ensino primário
matriculas_secundario=pd.read_excel(path+'Enrollment-Number/enrollment-secondary-education-number.xlsx') #total de alunos matriculados no ensino secundário
matriculas_tecnico=pd.read_excel(path+'Enrollment-Number/enrollment-post_secondary-non-terciary-education-number.xlsx') #total de alunos matriculados no ensino técnico
matriculas_universitario=pd.read_excel(path+'Enrollment-Number/enrollment-terciary-education-number.xlsx') #total de alunos matriculados no ensino terciário

In [88]:
#Proporcao do total de indivíduos em idade escolar matriculados nos ensinos primário e secundário

proporcao_matriculados_primario=pd.read_excel(path+'Enrollment-Ratio/enrollment-ratio-primary.xlsx') #proporcao de matriculados no ensino primario
proporcao_matriculados_secundario=pd.read_excel(path+'Enrollment-Ratio/enrollment-ratio-upper-secondary.xlsx') #proporcao de matriculados no ensino médio

In [89]:
#Investimentos em cada nível educacional como proporcao do PIB

investimento_porcentagem_PIB_pre_primario=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/pre-primario.xlsx') #investimento público em ensino pré-primário
investimento_porcentagem_PIB_primario=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/primario.xlsx') #investimento público em ensino primário
investimento_porcentagem_PIB_lower_secondary=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/lower-secondary.xlsx') #investimento público em ensino lower-secondary
investimento_porcentagem_PIB_upper_secondary=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/upper-secondary.xlsx') #investimento público em ensino upper-secondary
investimento_porcentagem_PIB_secondary=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/secondary.xlsx') #investimento público em ensino secondary
investimento_porcentagem_PIB_tecnico=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/post-secondary-non-terciary.xlsx') #investimento público em ensino técnico
investimento_porcentagem_PIB_universitario=pd.read_excel(path+'Government expenditure on education as a percentage of GDP/terciary.xlsx') #investimento público em ensino universitário

In [90]:
#Estudantes estrangeiros
#Diferença entre o número de alunos estrangeiros no países e o número de alunos do país estudanto fora

entrada_menos_saida_alunos=pd.read_excel(path+'Mobile Students/net-flow-internationally-mobile-students.xlsx') #investimento público em ensino pré-primário

# Pré-Processamento

## Dados Rankings

### Padronização dos nomes das colunas

In [91]:
#Padronização do nome das colunas para facilitar a comparação
#Ranking Times Higher Education

ranking_the.columns

Index(['Year', 'rank_order', 'rank', 'name', 'scores_overall',
       'scores_overall_rank', 'scores_teaching', 'scores_teaching_rank',
       'scores_international_outlook', 'scores_international_outlook_rank',
       'scores_industry_income', 'scores_industry_income_rank',
       'scores_research', 'scores_research_rank', 'scores_citations',
       'scores_citations_rank', 'location', 'aliases', 'subjects_offered',
       'closed', 'unaccredited', 'stats_number_students',
       'stats_student_staff_ratio', 'stats_pc_intl_students',
       'stats_female_male_ratio', 'stats_proportion_of_isr', 'male proportion',
       'female proportion'],
      dtype='object')

In [92]:
#Ranking QS

ranking_qs_2017_2022.columns

Index(['Institution Name', 'year', 'Overall Score Rank', 'Overall Score',
       'link', 'Country', 'city', 'region', 'logo', 'type', 'research_output',
       'student_faculty_ratio', 'international_students', 'Size',
       'faculty_count'],
      dtype='object')

In [93]:
#Ranking QS

ranking_qs_2023_2025.columns

Index(['2025 Rank', '2024 Rank', 'Institution Name', 'Country Code', 'Country',
       'Size', 'Academic Reputation Score', 'Employer Reputation Score',
       'Faculty Student Score', 'Citations per Faculty Score',
       'International Faculty Score', 'International Students Score',
       'International Research Network Score', 'Employment Outcomes Score',
       'Sustainability Score', 'Overall Score', 'Academic Reputation Rank',
       'Employer Reputation Rank', 'Faculty Student Rank',
       'Citations per Faculty Rank', 'International Faculty Rank',
       'International Students Rank', 'International Research Network Rank',
       'Employment Outcomes Rank', 'Sustainability Rank', 'Overall Score Rank',
       'year', '2024 RANK', '2023 RANK', 'FOCUS', 'RES.', 'AGE', 'STATUS',
       'Rank'],
      dtype='object')

In [94]:
#Ranking Shanghai

ranking_shanghai.columns

Index(['World Rank', 'Institution', 'Country', 'Regional Rank', 'Total Score',
       'Alumni', 'Award', 'HiCi', 'N&S', 'PUB', 'PCP', 'Year',
       'Country_Names'],
      dtype='object')

In [95]:
#Nomes iguais para as colunas com os mesmos dados em rankings diferentes
ranking_the.rename(columns={'name':'Institution','location':'Country','scores_overall':'Overall Score'},inplace=True)
ranking_qs_2017_2022.rename(columns={'Institution Name':'Institution','year':'Year'},inplace=True)
ranking_qs_2023_2025.rename(columns={'Institution Name':'Institution','year':'Year'},inplace=True)
ranking_shanghai.rename(columns={'Total Score':'Overall Score','Country':'Country Code','Country_Names':'Country'},inplace=True)

### Padronização dos nomes das Instituições

California Institute of Technology
California Institute of Technology (Caltech)	

Massachusetts Institute of Technology (MIT)
Massachusetts Institute of Technology
ranking_the.rename({})

In [96]:
ranking_the.replace({'California Institute of Technology':'California Institute of Technology (Caltech)',
                     'Massachusetts Institute of Technology':'Massachusetts Institute of Technology (MIT)'},inplace=True)

ranking_shanghai.replace({'California Institute of Technology':'California Institute of Technology (Caltech)'},inplace=True)

### Remover espaços do inicio e final de strings

In [97]:
ranking_the["Institution"]=ranking_the["Institution"].str.strip()
ranking_qs_2017_2022["Institution"]=ranking_qs_2017_2022["Institution"].str.strip()
ranking_qs_2023_2025["Institution"]=ranking_qs_2023_2025["Institution"].str.strip()
ranking_shanghai["Institution"]=ranking_shanghai["Institution"].str.strip()

## Dados Educacionais

In [98]:
#Nos valores provenientes da Unesco nos valores ausentes está a string ".."
#Substituir a string por NAN para permitir operações matemáticas nas colunas

#A função foi criada para evitar problemas com downcasting no uso do replace. Para maiores informações consultar o link:
#https://medium.com/@felipecaballero/deciphering-the-cryptic-futurewarning-for-fillna-in-pandas-2-01deb4e411a1
def replace_string_nan_unesco(x):
    with pd.option_context('future.no_silent_downcasting', True):
        x.replace('..',np.nan,inplace=True)
    return x

### Escolaridade média

In [99]:
#Escolaridade média (em anos) para pessoas acima de 25 anos
mean_year_schooling=replace_string_nan_unesco(mean_year_schooling)
mean_year_schooling.head()

,Country,2017,2018,2019,2020,2021,2022,2023
0,Estonia,13.55548,13.65631,NaN,13.54843,NaN,NaN,NaN
1,United States of America,13.41329,13.50162,NaN,13.68343,13.5755,13.9142,NaN
2,Lithuania,13.18839,NaN,NaN,13.4981,NaN,NaN,NaN
3,United Kingdom of Great Britain and Northern I...,13.16133,NaN,NaN,13.40612,13.4929,NaN,NaN
4,Norway,12.94716,NaN,13.00363,NaN,NaN,NaN,NaN

In [100]:
mean_year_schooling.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279 entries, 0 to 278
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  279 non-null    object
 1   2017     63 non-null     object
 2   2018     67 non-null     object
 3   2019     70 non-null     object
 4   2020     56 non-null     object
 5   2021     23 non-null     object
 6   2022     28 non-null     object
 7   2023     1 non-null      object
dtypes: object(8)
memory usage: 17.6+ KB

In [101]:
#Conversão dos dados na colunas com as idades média para formato numérico

mean_year_schooling.set_index('Country',inplace=True)
mean_year_schooling=mean_year_schooling.apply(lambda x:pd.to_numeric(x))
mean_year_schooling.reset_index(inplace=True)
mean_year_schooling

,Country,2017,2018,2019,2020,2021,2022,2023
0,Estonia,13.55548,13.65631,NaN,13.54843,NaN,NaN,NaN
1,United States of America,13.41329,13.50162,NaN,13.68343,13.57550,13.91420,NaN
2,Lithuania,13.18839,NaN,NaN,13.49810,NaN,NaN,NaN
3,United Kingdom of Great Britain and Northern I...,13.16133,NaN,NaN,13.40612,13.49290,NaN,NaN
4,Norway,12.94716,NaN,13.00363,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
274,Andorra,NaN,NaN,NaN,NaN,NaN,11.61344,NaN
275,American Samoa,NaN,NaN,NaN,NaN,NaN,NaN,NaN
276,Algeria,NaN,NaN,7.02027,NaN,NaN,NaN,NaN
277,Åland Islands,NaN,NaN,NaN,NaN,NaN,NaN,NaN
278,Afghanistan,NaN,NaN,NaN,NaN,2.98507,2.51479,NaN

In [102]:
mean_year_schooling.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279 entries, 0 to 278
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  279 non-null    object
 1   2017     63 non-null     float64
 2   2018     67 non-null     float64
 3   2019     70 non-null     float64
 4   2020     56 non-null     float64
 5   2021     23 non-null     float64
 6   2022     28 non-null     float64
 7   2023     1 non-null      float64
dtypes: float64(7), object(1)
memory usage: 17.6+ KB

### Número Total de Matriculados

In [103]:
#Total de alunos matriculados em cada nivel educacinal
#Dados estão em 4 dataframe, um para cada nivel educacional
#Criar um coluna em cada dataframe para permitir a concatenação em um único

matriculas_primario["Nivel de Ensino"]='Primario'
matriculas_secundario['Nivel de Ensino']='Secundario'
matriculas_tecnico['Nivel de Ensino']='Tecnico'
matriculas_universitario['Nivel de Ensino']='Universitario'

numero_matriculados=pd.concat([matriculas_primario,matriculas_secundario,matriculas_tecnico,matriculas_universitario],axis=0)

#Substituir strings nos valores ausentes
numero_matriculados=replace_string_nan_unesco(numero_matriculados)
numero_matriculados.head()

,Country,2017,2018,2019,2020,2021,2022,2023,Nivel de Ensino
0,Afghanistan,6350404,6544906,6777785,NaN,NaN,NaN,NaN,Primario
1,Åland Islands,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Primario
2,Albania,174836,170861,167104,162170,158528,154140,NaN,Primario
3,Algeria,4283207,4429994,4580288,4852322,4852322,5050667,5187616,Primario
4,American Samoa,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Primario

In [104]:
numero_matriculados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1116 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          1116 non-null   object
 1   2017             689 non-null    object
 2   2018             689 non-null    object
 3   2019             685 non-null    object
 4   2020             667 non-null    object
 5   2021             646 non-null    object
 6   2022             485 non-null    object
 7   2023             52 non-null     object
 8   Nivel de Ensino  1116 non-null   object
dtypes: object(9)
memory usage: 87.2+ KB

In [105]:
numero_matriculados=numero_matriculados.astype({col:'float64' for col in range(2017,2024)})

In [106]:
#Converter as colunas com os números de alunos para o formato numérico

numero_matriculados=numero_matriculados.astype({col:'float64' for col in range(2017,2024)})

In [107]:
numero_matriculados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1116 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          1116 non-null   object
 1   2017             689 non-null    float64
 2   2018             689 non-null    float64
 3   2019             685 non-null    float64
 4   2020             667 non-null    float64
 5   2021             646 non-null    float64
 6   2022             485 non-null    float64
 7   2023             52 non-null     float64
 8   Nivel de Ensino  1116 non-null   object
dtypes: float64(7), object(2)
memory usage: 87.2+ KB

### Proporção de indivíduos matriculados

In [108]:
#Proporção de alunos matriculados nos ensinos primário e secundários
#Criar nova coluna para permitir concatenação dos dados

proporcao_matriculados_primario['Nivel de Ensino']='Primario'
proporcao_matriculados_secundario['Nivel de Ensino']='Secundario'

proporcao_matriculados=pd.concat([proporcao_matriculados_primario,proporcao_matriculados_secundario],axis=0)

In [109]:
proporcao_matriculados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 558 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          558 non-null    object
 1   2017             558 non-null    object
 2   2018             558 non-null    object
 3   2019             558 non-null    object
 4   2020             558 non-null    object
 5   2021             558 non-null    object
 6   2022             558 non-null    object
 7   2023             558 non-null    object
 8   Nivel de Ensino  558 non-null    object
dtypes: object(9)
memory usage: 43.6+ KB

In [110]:
#Conversão das colunas com os dados das proporções para o formato numérico

proporcao_matriculados=replace_string_nan_unesco(proporcao_matriculados)
proporcao_matriculados=proporcao_matriculados.astype({col:'float64' for col in range(2017,2024)})

In [111]:
proporcao_matriculados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 558 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          558 non-null    object
 1   2017             289 non-null    float64
 2   2018             284 non-null    float64
 3   2019             280 non-null    float64
 4   2020             283 non-null    float64
 5   2021             282 non-null    float64
 6   2022             200 non-null    float64
 7   2023             28 non-null     float64
 8   Nivel de Ensino  558 non-null    object
dtypes: float64(7), object(2)
memory usage: 43.6+ KB

### Investimentos em educação como proporção do PIB

In [112]:
#Criação de nova coluna para idenfificar o nivel educacional
#Necessária pra concatenação dos dados

investimento_porcentagem_PIB_pre_primario['Nivel de Ensino']    ='Primario'
investimento_porcentagem_PIB_primario['Nivel de Ensino']        ='Secundario'
investimento_porcentagem_PIB_lower_secondary['Nivel de Ensino'] ='Lower Secondary'
investimento_porcentagem_PIB_upper_secondary['Nivel de Ensino'] ='Upper Secondary'
investimento_porcentagem_PIB_secondary['Nivel de Ensino']       ='Secondary'
investimento_porcentagem_PIB_tecnico['Nivel de Ensino']         ='Tecnico'
investimento_porcentagem_PIB_universitario['Nivel de Ensino']   ='Universitario'

investimento_porcentagem_PIB=pd.concat([investimento_porcentagem_PIB_pre_primario,
                                investimento_porcentagem_PIB_primario,
                                investimento_porcentagem_PIB_lower_secondary,
                                investimento_porcentagem_PIB_upper_secondary,
                                investimento_porcentagem_PIB_secondary,
                                investimento_porcentagem_PIB_tecnico,
                                investimento_porcentagem_PIB_universitario],axis=0)

In [113]:
investimento_porcentagem_PIB.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1954 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          1954 non-null   object
 1   2017             1953 non-null   object
 2   2018             1953 non-null   object
 3   2019             1953 non-null   object
 4   2020             1953 non-null   object
 5   2021             1953 non-null   object
 6   2022             1953 non-null   object
 7   2023             1953 non-null   object
 8   Nivel de Ensino  1954 non-null   object
dtypes: object(9)
memory usage: 152.7+ KB

In [114]:
#Conversão dos dados para formato numérico

investimento_porcentagem_PIB=replace_string_nan_unesco(investimento_porcentagem_PIB)
investimento_porcentagem_PIB=investimento_porcentagem_PIB.astype({col:'float64' for col in range(2017,2024)})

In [115]:
investimento_porcentagem_PIB.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1954 entries, 0 to 278
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          1954 non-null   object
 1   2017             624 non-null    float64
 2   2018             612 non-null    float64
 3   2019             625 non-null    float64
 4   2020             588 non-null    float64
 5   2021             359 non-null    float64
 6   2022             266 non-null    float64
 7   2023             12 non-null     float64
 8   Nivel de Ensino  1954 non-null   object
dtypes: float64(7), object(2)
memory usage: 152.7+ KB

### Investimentos em educação (em milhões de dólares)

In [116]:
investimento_em_milhoes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279 entries, 0 to 278
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  279 non-null    object
 1   2017     279 non-null    object
 2   2018     279 non-null    object
 3   2019     279 non-null    object
 4   2020     279 non-null    object
 5   2021     279 non-null    object
 6   2022     279 non-null    object
 7   2023     279 non-null    object
dtypes: object(8)
memory usage: 17.6+ KB

In [117]:
#Conversão dos dados para formato numérico

investimento_em_milhoes=replace_string_nan_unesco(investimento_em_milhoes)
investimento_em_milhoes=investimento_em_milhoes.astype({col:'float64' for col in range(2017,2024)})

In [118]:
investimento_em_milhoes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279 entries, 0 to 278
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  279 non-null    object
 1   2017     123 non-null    float64
 2   2018     110 non-null    float64
 3   2019     90 non-null     float64
 4   2020     80 non-null     float64
 5   2021     43 non-null     float64
 6   2022     24 non-null     float64
 7   2023     0 non-null      float64
dtypes: float64(7), object(1)
memory usage: 17.6+ KB

In [119]:
investimento_em_milhoes.head()
ranking_the.apply(lambda x: x.str.strip() if isinstance(x,str) else x)

,Year,rank_order,rank,Institution,Overall Score,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_international_outlook,scores_international_outlook_rank,...,subjects_offered,closed,unaccredited,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,stats_proportion_of_isr,male proportion,female proportion
0,2011,1,1,Harvard University,96.1,1.0,99.7,1.0,72.4,49.0,...,"Mathematics & Statistics,Civil Engineering,Lan...",False,False,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011,2,2,California Institute of Technology (Caltech),96.0,2.0,97.7,4.0,54.6,93.0,...,"Languages, Literature & Linguistics,Economics ...",False,False,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2011,3,3,Massachusetts Institute of Technology (MIT),95.6,3.0,97.8,3.0,82.3,36.0,...,"Mathematics & Statistics,Languages, Literature...",False,False,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2011,4,4,Stanford University,94.3,4.0,98.3,2.0,29.5,156.0,...,"Physics & Astronomy,Computer Science,Politics ...",False,False,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2011,5,5,Princeton University,94.2,5.0,90.9,6.0,70.3,53.0,...,"Languages, Literature & Linguistics,Biological...",False,False,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15991,2024,1000762,Reporter,Zarqa University,NaN,NaN,NaN,NaN,NaN,NaN,...,"General Engineering,Civil Engineering,Electric...",False,False,5881.0,17.0,35%,60 : 40,30%,60.0,40.0
15992,2024,1000763,Reporter,Zhetysu University,NaN,NaN,NaN,NaN,NaN,NaN,...,"History, Philosophy & Theology,Psychology,Lang...",False,False,4872.0,18.2,0%,66 : 34,16%,66.0,34.0
15993,2024,1000764,Reporter,Zhytomyr Polytechnic State University,NaN,NaN,NaN,NaN,NaN,NaN,...,"Law,Economics & Econometrics,Politics & Intern...",False,False,4454.0,16.1,1%,40 : 60,35%,40.0,60.0
15994,2024,1000765,Reporter,Ziane Achour University of Djelfa,NaN,NaN,NaN,NaN,NaN,NaN,...,"Architecture,Agriculture & Forestry,Biological...",False,False,31103.0,28.5,0%,55 : 45,35%,55.0,45.0
15995,2024,1000766,Reporter,Ziauddin University,NaN,NaN,NaN,NaN,NaN,NaN,...,"Medicine & Dentistry,Other Health",False,False,5672.0,9.2,0%,58 : 42,5%,58.0,42.0

### Investimentos públocs e privados diretos em educação (em porcentagem do PIB)

In [120]:
investimentos_publicos_privados.head()

,Country,Ano,Gastos Governamentais Totais,Gastros Privados Totais,Gastos Governamentais em Educacao Elementar e Secundaria,Gastos Privados em Educacao Elementar e Secundaria,Gastos Governamentais em Educacao Superior,Gastos Privados em Educacao Superior
0,OECD average,2005,4.3,---,3.3,---,1,---
1,Australia,2005,3.9,---,3.2,---,0.7,---
2,Austria,2005,---,---,---,---,---,---
3,Belgium,2005,5,---,3.9,---,1.1,---
4,Canada,2005,4.4,---,3.1,---,1.3,---

In [121]:
investimentos_publicos_privados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 282 entries, 0 to 281
Data columns (total 8 columns):
 #   Column                                                    Non-Null Count  Dtype
---  ------                                                    --------------  -----
 0   Country                                                   282 non-null    object
 1   Ano                                                       282 non-null    int64
 2   Gastos Governamentais Totais                              282 non-null    object
 3   Gastros Privados Totais                                   282 non-null    object
 4   Gastos Governamentais em Educacao Elementar e Secundaria  282 non-null    object
 5   Gastos Privados em Educacao Elementar e Secundaria        282 non-null    object
 6   Gastos Governamentais em Educacao Superior                282 non-null    object
 7   Gastos Privados em Educacao Superior                      282 non-null    object
dtypes: int64(1), object(7)
memory usage: 17.8+ KB

In [122]:
#Nos valores ausentes desse conjunto de dados (o único que não foi baixado do site da Unesco) nos valores ausentes está a string '---'
#Em alguns caso nos valores ausentes está o simbolo '#'

with pd.option_context('future.no_silent_downcasting', True):
    investimentos_publicos_privados.replace('---',np.nan,inplace=True)

with pd.option_context('future.no_silent_downcasting', True):
    investimentos_publicos_privados.replace('#',np.nan,inplace=True)

In [123]:
# Converter colunas para formato numérico

investimentos_publicos_privados=investimentos_publicos_privados.astype({col:'float64' for col in investimentos_publicos_privados.columns if col not in ['Country','Ano']})

In [124]:
investimentos_publicos_privados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 282 entries, 0 to 281
Data columns (total 8 columns):
 #   Column                                                    Non-Null Count  Dtype
---  ------                                                    --------------  -----
 0   Country                                                   282 non-null    object
 1   Ano                                                       282 non-null    int64
 2   Gastos Governamentais Totais                              243 non-null    float64
 3   Gastros Privados Totais                                   36 non-null     float64
 4   Gastos Governamentais em Educacao Elementar e Secundaria  248 non-null    float64
 5   Gastos Privados em Educacao Elementar e Secundaria        34 non-null     float64
 6   Gastos Governamentais em Educacao Superior                245 non-null    float64
 7   Gastos Privados em Educacao Superior                      36 non-null     float64
dtypes: float64(6), int64(1), object(1)
memory usage: 17.8+ KB

# Comparativo

## Universidades no top 10 do último ranking publicado por cada uma das instituições

In [125]:
top10_the_2024=ranking_the.loc[ranking_the["Year"]==2024,:].iloc[:10,:].reset_index(drop=True)
top10_the_2024

,Year,rank_order,rank,Institution,Overall Score,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_international_outlook,scores_international_outlook_rank,...,subjects_offered,closed,unaccredited,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,stats_proportion_of_isr,male proportion,female proportion
0,2024,10,1,University of Oxford,98.5,10.0,96.6,5.0,97.5,14.0,...,"Geography,Chemistry,Chemical Engineering,Biolo...",False,False,21750.0,10.9,42%,49 : 51,23%,49.0,51.0
1,2024,20,2,Stanford University,98.0,20.0,99.0,1.0,87.0,168.0,...,"Computer Science,Communication & Media Studies...",False,False,14517.0,6.4,23%,47 : 53,22%,47.0,53.0
2,2024,30,3,Massachusetts Institute of Technology (MIT),97.9,30.0,98.6,2.0,93.8,66.0,...,"Architecture,Economics & Econometrics,Archaeol...",False,False,11085.0,8.0,33%,41 : 59,40%,41.0,59.0
3,2024,40,4,Harvard University,97.8,40.0,97.7,3.0,90.8,120.0,...,"Sociology,Architecture,Physics & Astronomy,Psy...",False,False,20050.0,9.0,25%,51 : 49,12%,51.0,49.0
4,2024,50,5,University of Cambridge,97.5,50.0,95.8,7.0,97.4,15.0,...,Politics & International Studies (incl Develop...,False,False,20565.0,11.5,38%,48 : 52,27%,48.0,52.0
5,2024,60,6,Princeton University,96.9,60.0,96.3,6.0,89.1,136.0,...,"History, Philosophy & Theology,Agriculture & F...",False,False,7753.0,7.3,23%,47 : 53,43%,47.0,53.0
6,2024,70,7,California Institute of Technology (Caltech),96.5,70.0,96.6,4.0,90.6,124.0,...,"Computer Science,Chemistry,Chemical Engineerin...",False,False,2240.0,6.1,33%,37 : 63,49%,37.0,63.0
7,2024,80,8,Imperial College London,95.1,80.0,90.9,12.0,98.3,6.0,...,"Computer Science,Mechanical & Aerospace Engine...",False,False,20275.0,11.8,61%,42 : 58,28%,42.0,58.0
8,2024,90,9,"University of California, Berkeley",94.6,90.0,87.2,18.0,86.8,172.0,...,"Chemistry,Electrical & Electronic Engineering,...",False,False,39991.0,17.9,22%,52 : 48,36%,52.0,48.0
9,2024,100,10,Yale University,94.2,100.0,94.0,10.0,82.4,217.0,...,"Law,Computer Science,Electrical & Electronic E...",False,False,11924.0,5.2,21%,51 : 49,13%,51.0,49.0

In [126]:
top10_qs_2025=ranking_qs_2023_2025[ranking_qs_2023_2025['Year']==2025].iloc[:10,:].reset_index(drop=True)
top10_qs_2025

,2025 Rank,2024 Rank,Institution,Country Code,Country,Size,Academic Reputation Score,Employer Reputation Score,Faculty Student Score,Citations per Faculty Score,...,Sustainability Rank,Overall Score Rank,Year,2024 RANK,2023 RANK,FOCUS,RES.,AGE,STATUS,Rank
0,1,1,Massachusetts Institute of Technology (MIT),US,United States,M,100.0,100.0,100.0,100.0,...,15.0,1.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,6,Imperial College London,UK,United Kingdom,L,98.5,99.5,98.2,93.9,...,5.0,2.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,3,University of Oxford,UK,United Kingdom,L,100.0,100.0,100.0,84.8,...,126.0,3.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,4,Harvard University,US,United States,L,100.0,100.0,96.3,100.0,...,130.0,4.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,2,University of Cambridge,UK,United Kingdom,L,100.0,100.0,100.0,84.6,...,127.0,5.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6,5,Stanford University,US,United States,L,100.0,100.0,100.0,99.0,...,148.0,6.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,7,7,ETH Zurich - Swiss Federal Institute of Techno...,CH,Switzerland,L,98.8,87.2,65.9,97.9,...,18.0,7.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,8,8,National University of Singapore (NUS),SG,Singapore,XL,99.5,91.1,68.8,93.1,...,24.0,8.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,9,9,UCL,UK,United Kingdom,XL,99.5,98.3,95.9,72.2,...,190.0,9.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10,15,California Institute of Technology (Caltech),US,United States,S,96.5,95.3,100.0,100.0,...,253.0,10.0,2025,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [127]:
top10_shanghai_2023=ranking_shanghai[ranking_shanghai['Year']==2023].iloc[:10,:].reset_index(drop=True)
top10_shanghai_2023

,World Rank,Institution,Country Code,Regional Rank,Overall Score,Alumni,Award,HiCi,N&S,PUB,PCP,Year,Country
0,1,Harvard University,us,1,100.0,100.0,92.6,100.0,100.0,100.0,86.7,2023,United States
1,2,Stanford University,us,2,74.8,45.6,88.1,73.6,82.8,67.5,58.0,2023,United States
2,3,Massachusetts Institute of Technology (MIT),us,3,69.1,72.5,81.1,54.7,71.8,55.0,73.8,2023,United States
3,4,University of Cambridge,gb,1,67.9,78.9,90.8,45.1,61.0,63.6,60.4,2023,United Kingdom
4,5,"University of California, Berkeley",us,4,63.4,65.8,76.5,52.6,64.3,53.1,57.3,2023,United States
5,6,Princeton University,us,5,60.1,61.7,100.0,32.9,50.4,39.4,76.7,2023,United States
6,7,University of Oxford,gb,2,59.5,49.9,59.7,51.4,57.6,71.4,48.5,2023,United Kingdom
7,8,Columbia University,us,6,55.3,58.5,60.9,47.0,52.3,63.1,32.1,2023,United States
8,9,California Institute of Technology (Caltech),us,7,54.5,56.1,63.4,28.7,57.3,37.6,100.0,2023,United States
9,10,University of Chicago,us,8,53.8,56.6,84.5,35.4,42.5,48.6,44.6,2023,United States

In [128]:
#Universidades no top 10 de cada ranking
top_10_tres_rankings=pd.concat([top10_the_2024.loc[:,['Institution']].rename(columns={'Institution':'Top 10 THE'}),
                                top10_qs_2025.loc[:,['Institution']].rename(columns={'Institution':'Top 10 QS'}),
                                top10_shanghai_2023.loc[:,['Institution']].rename(columns={'Institution':'Top 10 Shanghai'})],axis=1)

top_10_tres_rankings.index=[str(i)+'°' for i in range(1,11)]
top_10_tres_rankings

,Top 10 THE,Top 10 QS,Top 10 Shanghai
1°,University of Oxford,Massachusetts Institute of Technology (MIT),Harvard University
2°,Stanford University,Imperial College London,Stanford University
3°,Massachusetts Institute of Technology (MIT),University of Oxford,Massachusetts Institute of Technology (MIT)
4°,Harvard University,Harvard University,University of Cambridge
5°,University of Cambridge,University of Cambridge,"University of California, Berkeley"
6°,Princeton University,Stanford University,Princeton University
7°,California Institute of Technology (Caltech),ETH Zurich - Swiss Federal Institute of Techno...,University of Oxford
8°,Imperial College London,National University of Singapore (NUS),Columbia University
9°,"University of California, Berkeley",UCL,California Institute of Technology (Caltech)
10°,Yale University,California Institute of Technology (Caltech),University of Chicago

In [129]:
#Universidades que aparecem nos top 10 dos três rankings

inter_THE_QS=top_10_tres_rankings.loc[top_10_tres_rankings['Top 10 THE'].isin(top_10_tres_rankings['Top 10 QS']),['Top 10 THE']] #universidades que estão no THE e QS
intersecção_tres_rankings=inter_THE_QS.loc[inter_THE_QS['Top 10 THE'].isin(top_10_tres_rankings['Top 10 Shanghai']),:] #Universidades que estão no THE e QS e também no Shanghai
intersecção_tres_rankings.reset_index(drop=True,inplace=True)
intersecção_tres_rankings=intersecção_tres_rankings.rename(columns={'Top 10 THE':'Intersecção top 10 dos três rankings'})

In [130]:
#Criação de dataframe com as universidades que aparecem nos top 10 dos três rankings e as posições dessas universidades em cada ranking

posicoes_THE      = []
posicoes_QS       = []
posicoes_Shanghai = []
for universidade in intersecção_tres_rankings.iloc[:,0].to_list():
    posicoes_THE.append((top_10_tres_rankings.iloc[:,0]==universidade)[top_10_tres_rankings.iloc[:,0]==universidade].index[0])
    posicoes_QS.append((top_10_tres_rankings.iloc[:,1]==universidade)[top_10_tres_rankings.iloc[:,1]==universidade].index[0])
    posicoes_Shanghai.append((top_10_tres_rankings.iloc[:,2]==universidade)[top_10_tres_rankings.iloc[:,2]==universidade].index[0])

intersecção_tres_rankings=intersecção_tres_rankings.assign(Posição_Ranking_THE=posicoes_THE)
intersecção_tres_rankings=intersecção_tres_rankings.assign(Posição_Ranking_QS=posicoes_QS)
intersecção_tres_rankings=intersecção_tres_rankings.assign(Posição_Ranking_Shanghai=posicoes_Shanghai)

intersecção_tres_rankings

,Intersecção top 10 dos três rankings,Posição_Ranking_THE,Posição_Ranking_QS,Posição_Ranking_Shanghai
0,University of Oxford,1°,3°,7°
1,Stanford University,2°,6°,2°
2,Massachusetts Institute of Technology (MIT),3°,1°,3°
3,Harvard University,4°,4°,1°
4,University of Cambridge,5°,5°,4°
5,California Institute of Technology (Caltech),7°,10°,9°

In [131]:
# 7 universidades em comum no top 10 da Times Higher Education e da QS
print('Universidade em comum no top 10 dos rankings THE e QS: {}'.format(
    int(top_10_tres_rankings['Top 10 THE'].isin(top_10_tres_rankings['Top 10 QS']).sum())))

Universidade em comum no top 10 dos rankings THE e QS: 7

In [132]:
#Comparativo top 10 THE e QS
#Universidades que estão em um ranking mas não no outro

somente_the=~top_10_tres_rankings['Top 10 THE'].isin(top_10_tres_rankings['Top 10 QS']) #Top 10 THE mas não top 10 QS (~ para indicar negação)
somente_qs=~top_10_tres_rankings['Top 10 QS'].isin(top_10_tres_rankings['Top 10 THE'])  #Top 10 QS mas não top 10 THE

#somente_the indica quais universidade estão no ranking THE mas não no qs

comparativo_THE_QS=pd.concat([top_10_tres_rankings.loc[somente_the,['Top 10 THE']].reset_index(drop=True).rename(columns={'Top 10 THE':'Somente THE'}),
                              top_10_tres_rankings.loc[somente_qs,['Top 10 QS']].reset_index(drop=True).rename(columns={'Top 10 QS':'Somente QS'})],axis=1)
comparativo_THE_QS

,Somente THE,Somente QS
0,Princeton University,ETH Zurich - Swiss Federal Institute of Techno...
1,"University of California, Berkeley",National University of Singapore (NUS)
2,Yale University,UCL

In [133]:
# 8 universidades em comum no top 10 da Times Higher Education e do ranking Shanghai

print('Universidade em comum no top 10 dos rankings THE e Shanghai: {}'.format(
    int(top_10_tres_rankings['Top 10 THE'].isin(top_10_tres_rankings['Top 10 Shanghai']).sum())))

Universidade em comum no top 10 dos rankings THE e Shanghai: 8

In [134]:
#Comparativo top 10 THE e Shanghai
#Universidades que estão em um ranking mas não no outro

somente_the     =~top_10_tres_rankings['Top 10 THE'].isin(top_10_tres_rankings['Top 10 Shanghai']) #Top 10 THE mas não top 10 Shanghai
somente_Shanghai=~top_10_tres_rankings['Top 10 Shanghai'].isin(top_10_tres_rankings['Top 10 THE'])  #Top 10 Shanghai mas não top 10 THE

comparativo_THE_Shanghai=pd.concat([top_10_tres_rankings.loc[somente_the,['Top 10 THE']].reset_index(drop=True).rename(columns={'Top 10 THE':'Somente THE'}),
                              top_10_tres_rankings.loc[somente_Shanghai,['Top 10 Shanghai']].reset_index(drop=True).rename(columns={'Top 10 QS':'Somente Shanghai'})],axis=1)
comparativo_THE_Shanghai

               Somente THE        Top 10 Shanghai
0  Imperial College London    Columbia University
1          Yale University  University of Chicago

In [135]:
# 6 universidades em comum no top 10 da QS e do ranking Shanghai

print('Universidade em comum no top 10 dos rankings QS e Shanghai: {}'.format(
    int(top_10_tres_rankings['Top 10 QS'].isin(top_10_tres_rankings['Top 10 Shanghai']).sum())))

Universidade em comum no top 10 dos rankings QS e Shanghai: 6

In [136]:
#Comparativo top 10 QS e Shanghai
#Universidades que estão em um ranking mas não no outro

somente_QS      =~top_10_tres_rankings['Top 10 QS'].isin(top_10_tres_rankings['Top 10 Shanghai'])    #Top 10 QS mas não top 10 Shanghai
somente_Shanghai=~top_10_tres_rankings['Top 10 Shanghai'].isin(top_10_tres_rankings['Top 10 QS'])    #Top 10 Shanghai mas não top 10 THE

comparativo_QS_Shanghai=pd.concat([top_10_tres_rankings.loc[somente_QS,['Top 10 QS']].reset_index(drop=True).rename(columns={'Top 10 QS':'Somente QS'}),
                              top_10_tres_rankings.loc[somente_Shanghai,['Top 10 Shanghai']].reset_index(drop=True).rename(columns={'Top 10 QS':'Somente Shanghai'})],axis=1)
comparativo_QS_Shanghai

,Somente QS,Top 10 Shanghai
0,Imperial College London,"University of California, Berkeley"
1,ETH Zurich - Swiss Federal Institute of Techno...,Princeton University
2,National University of Singapore (NUS),Columbia University
3,UCL,University of Chicago

## todo

In [137]:
#Ranking THE
#Países de origem das universidades no top 10 do ranking THE

top10_the_2024['Country'].value_counts()

Country
United States     7
United Kingdom    3
Name: count, dtype: int64

In [138]:
#Ranking QS
#Países de origem das universidades no top 10 do ranking QS

top10_qs_2025['Country'].value_counts()

Country
United States     4
United Kingdom    4
Switzerland       1
Singapore         1
Name: count, dtype: int64

In [139]:
#Ranking Shanghai
#Países de origem das universidades no top 10 do ranking Shanghai

top10_shanghai_2023['Country'].value_counts()

Country
United States     8
United Kingdom    2
Name: count, dtype: int64

## todo

In [143]:
top100_the_2024=ranking_the.loc[ranking_the["Year"]==2024,:].iloc[:100,:].reset_index(drop=True)
top100_qs_2025=ranking_qs_2023_2025[ranking_qs_2023_2025['Year']==2025].iloc[:100,:].reset_index(drop=True)
top100_shanghai_2023=ranking_shanghai[ranking_shanghai['Year']==2023].iloc[:100,:].reset_index(drop=True)

In [164]:
location_top100_the     =pd.DataFrame(top100_the_2024.loc[:,['Country']].value_counts()).rename(columns={'count':'Ranking THE'})
location_top100_qs      =pd.DataFrame(top100_qs_2025.loc[:,['Country']].value_counts()).rename(columns={'count':'Ranking QS'})
location_top100_shanghai=pd.DataFrame(top100_shanghai_2023.loc[:,['Country']].value_counts()).rename(columns={'count':'Ranking Shanghai'})

location_top_100=pd.concat([location_top100_the,location_top100_qs,location_top100_shanghai],axis=1)
location_top_100=location_top_100.fillna(value=0)
location_top_100=location_top_100.astype('int')
location_top_100.style.set_caption("Países de Origem das Universidades no top 100")

## todo

In [ ]:
#Universidades que oucuparam as primeiras posições dos rankings THE ao longo dos anos

primeiro_lugar_THE=ranking_the[ranking_the['rank']=='1'].loc[:,['Year','Institution']].reset_index(drop=True)
primeiro_lugar_THE.style.format().hide(axis='index')

In [ ]:
#Universidades que oucuparam as primeiras posições dos rankings QS ao longo dos anos

primeiro_lugar_QS_17_22=ranking_qs_2017_2022[ranking_qs_2017_2022['Overall Score Rank']=='1'].loc[:,["Year",'Institution']]
primeiro_lugar_QS_23_25=ranking_qs_2023_2025[ranking_qs_2023_2025['Overall Score Rank']==1].loc[:,["Year",'Institution']]

primeiro_lugar_QS= pd.concat([primeiro_lugar_QS_17_22,
                              primeiro_lugar_QS_23_25],axis=0)

primeiro_lugar_QS.sort_values(by="Year",inplace=True)
primeiro_lugar_QS.reset_index(drop=True,inplace=True)
primeiro_lugar_QS.style.format().hide(axis='index')

In [ ]:
#Universidades que oucuparam as primeiras posições dos rankings Shanghai ao longo dos anos

primeiro_lugar_Shanghai=ranking_shanghai[ranking_shanghai['World Rank']=='1'].loc[:,['Year','Institution']].reset_index(drop=True)
primeiro_lugar_Shanghai.style.format().hide(axis='index')